models/deepseek-v2-lite-lmcache-mp/benchmark_results/p50_sweep_20260324_124246/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x796c6f9ea980>, trust_remote_code=False, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_sweep_20260324_124246', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-ecb3781f-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=True, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 03-24 12:43:08 [datasets.py:631] Sampling input_len from [1869, 1869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:31<00:00,  3.20it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  31.25     
Total input tokens:                      786900    
Total generated tokens:                  25200     
Request throughput (req/s):              3.20      
Output token throughput (tok/s):         806.37    
Peak output token throughput (tok/s):    1873.00   
Peak concurrent requests:                96.00     
Total token throughput (tok/s):          25986.19  
---------------Time to First Token----------------
Mean TTFT (ms):                          758.84    
Median TTFT (ms):                        724.28    
P50 TTFT (ms):                           724.28    
P90 TTFT (ms):                           993.29    
P95 TTFT (ms):                           1210.27   
P99 TTFT (ms):                           1382.86   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.41     
Median TPOT (ms):                        63.08     
P50 TPOT (ms):                           63.08     
P90 TPOT (ms):                           73.13     
P95 TPOT (ms):                           73.74     
P99 TPOT (ms):                           74.36     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.41     
Median ITL (ms):                         44.46     
P50 ITL (ms):                            44.46     
P90 ITL (ms):                            102.91    
P95 ITL (ms):                            134.42    
P99 ITL (ms):                            183.89    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          16173.29  
Median E2EL (ms):                        16490.52  
P50 E2EL (ms):                           16490.52  
P90 E2EL (ms):                           18958.54  
P95 E2EL (ms):                           19155.06  
P99 E2EL (ms):                           19304.17  
==================================================
/usr/lib/python3.12/asyncio/events.py:88: UserWarning: Failed to generate timeline plot: Please install vllm[bench] for bench support
  self._context.run(self._callback, *self._args)